{
   "Jammu&Kashmir":{
      "value":"September to early March is the best time to visit Jammu. Jammu can be uncannily hot during the summer season with temperatures rising up to 45-48 degree celcius. Winters are also an ideal time to visit. Thus the old seat of the mighty Dogras and a city dotted with numerous temples is best to visit during winter. This is definitely the finest time to catch a glimpse of the ‘heaven on earth’, accompanied by a lovely chill in the air, hints of snow here and there and the landscape absolutely lush. One can also visit Jammu during the popular festivals like Makara Sankranti (January), Ram Navami (March) and Deepavali (October) when the whole town gets drenched in festivities."
   },
   "Himachal Pradesh":{
      "value":"February to June (Spring and Summer) is the best time to visit Himachal. The state also undergoes a beautiful transformation during the winters, i.e., between October and February when it's the snowfall season. This is also the best time for skiing and ice skating. Places like Rohtang Pass, Kufri and Shimla are quite popular tourist destinations. Summers are an ideal time for trekking, paragliding, camping and water sports. Most treks during this time take place in Shimla, Manali and Dharamshala. During monsoons from July to September, it is suggested to avoid certain areas in Himachal that are prone to landslides."
   },
   "Punjab":{
      "value":"Punjab, the land of five rivers, is best visited between the months of October and March. It is winter and spring season in the state during this time. The weather is pleasantly cold at the beginning of the winter season and drops down incredibly during the peak season. It further makes exploring the attractions a tremendously enjoyable experience during the day without having to bear the scorching heat or rainfall. The summers, that follow immediately, make the state extremely hot and humid. A trip to Punjab during this season is not at all advisable to the tourists. Monsoons, however, can be a good idea sometimes depending on the region being explored as certain locations receive heavy rainfall during the season."
   },
   "Haryana":{
      "value":"October to March is the best time to visit Haryana owing to the favourable weather conditions during this time. It starts getting colder and pleasant around this time making it a perfect time for venturing out for sightseeing."
   },
   "Uttar Pradesh":{
      "value":"While one can visit Uttar Pradesh all year around, it is best suggested for tourists to go for it between October to March as the weather gets pleasant with the approaching winters and the chill in the air is a welcome change for travelers."
   },
   "Utrakhand":{
      "value":"March- April and September - October are considered as the Best time to visit Uttarakhand. Trekking, Paragliding and The Char Dham Yatra are the most popular activities during Summer, which is also the Peak Season in Uttarakhand. While winters from November through February are perfect for rafting in Rishikesh and wildlife spotting in Jim Corbett National Park. Some parts of Uttarakhand like Mussoorie and Nainital experience snowfall. Although an all year round destination, it is not advisable to visit Uttarakhand during peak monsoons in July and August. However, Valley of Flowers is picture perfect during the monsoon season."
   },
   "Rajasthan":{
      "value":"The best time to visit Rajasthan is between October and February which is the winter season as the temperature remains warm and pleasant throughout the day during winters making it perfect explore all the palaces, temples, and forts. July to September can also be an excellent time to visit as the mostly dry and arid state receives some amount of rainfall, but the humidity and the temperatures are mostly high. The state also experiences extremely high temperatures during the summer season which begin in March and last till June."
   },
   "Madhya Pradesh":{
      "value":"Madhya Pradesh, located in the heart of the country, can be visited in any season depending on the reason for the visit. The vast expanse of the state experiences varied temperatures in different regions and different seasons. Therefore, some areas could be suitable for summers, while some for monsoons and winters. For the tourists, however, it is best when visited during the winter (october - march) and monsoon (july - september) season as the temperature remains pleasant through the day (with mostly moderate rainfall during monsoons) allowing them to explore the tourist attractions to their satisfaction. Summers (april - june), however, are not always recommended as the state experience scorching heat, especially in the peak season."
   },
   "Gujrat":{
      "value":"The best time to visit Gujarat is during the winter season, i.e. between October and February. Since it is a dry region and experiences high temperatures and humidity; visiting the state in the monsoons (July to September) may also be a good idea especially in the regions that receive less or no rainfall. During summers, i.e. between March and June, the temperature soars high, making it difficult for travellers to explore most of the attractions, but there are some places worth visiting like the Saputara Hill Station and the natural reserves that provide quite some respite in the scorching heat."
   },
   "Bihar":{
      "value":"The summers can get scorching in Bihar, and this can severely limit outdoor activity. The best time to visit this state is after the monsoon and before summer during the months of October to March. However, since tourist destinations can get very crowded during this season, it as advisable to book all arrangements in advance to avoid last minute disappointment. "
   },
   "Sikkim":{
      "value":"The best time to visit Sikkim can be two slots in a year, i.e., March and May or October and mid-December. March to May is the best time to visit Sikkim if you want to encounter the blooming and raw beauty of Gangtok. Winter season is most suited for you if you want to witness various festivities like Maniram Bhanjyang Tourism Festival, cherry Tea Festival, Red Panda Winter Festival etc."
   },
   "Assam":{
      "value":"October to April are the best months to visit Assam. While Assam sweats in the scorching heat during Summers, the state experiences high rainfall and humidity during Monsoon. During October to April, when the weather is pleasant with sunny days and cool nights, the rainfall is moderate, and the paddy fields look resplendent, is the best time to visit Assam."
   },
   "Arunachal Pradesh":{
      "value":"October and April are the best months to visit Arunachal Pradesh which are the winter and the spring months for the state. Arunachal is located at a high altitude, and so has pleasant weather throughout the year. During the summers (April to June) temperature might be too high to explore during the peak daytime hours. July to September is the monsoon season in the state when the terrain transforms into a beautiful green paradise, but many tourist attractions may be closed due to heavy rainfall."
   },
   "Meghalaya":{
      "value":"Often called the abode of clouds, the best time to visit Meghalaya is between October and June. Most tourist destinations in the state receive temperatures that rarely go beyond 30°C, making it a perfect escape between March and June which is the summer season in the country. It is also a favourite during autumn and winters, i.e. from October to November and December to February amongst tourists who come from high or moderate temperature zones. Considered the wettest region in the country, Meghalaya is not often recommended to tourists during peak monsoons. The state receives an average rainfall of 250 cm. The season begins in May and goes on till the end of September or sometimes till mid-October. One can, however, explore the beautiful state in the beginning or by the end of the monsoon season when the rains are not heavy and the terrain is mesmerisingly beautiful."
   },
   "Nagaland":{
      "value":"Nagaland consists of mountains and rivers, and this dictates its climatic conditions. The state sees high rainfall and humidity and this season is usually avoided by tourists because it is common to have landslides and road blockages during this time. Summers are cooler than the rest of India because of the high altitude and is ideal for visiting the forests and mountains of Nagaland. Winter is the preferable season since temperatures are low to moderate and touring the cities during this time is an absolute breeze."
   },
   "Manipur":{
      "value":"It is advised to visit Manipur during winters until the onset of summers; most suggest the duration between October to March as the ideal time to pay the state a visit. While the weather is not so harsh throughout the year, it's considerably more pleasant and cosy during winters and very welcoming as it gets slightly warm with the coming summers."
   },
   "Mizoram":{
      "value":"Mizoram witnesses three seasons- summer, winter and monsoon. However, extreme temperatures are not observed in any of the seasons. Summer starts in March and then monsoon season starts taking over from May onwards. Winter is the best time to explore the state. The cool weather along with lovely landscapes will swoon you. The temperature during this period remains in perfect range for travellers."
   },
   "Tripura":{
      "value":"Like all North-Eastern state, the climate in Tripura throughout the year is relatively humid yet cooler than the mainland temperature. Because of the uneven terrain, the climate in each region and city varies considerably depending on the altitude. Overall, winter is the best season to visit this state since the temperature is pleasant and ideal for sightseeing in the towns and to witness the beautiful natural wonders. It is best to avoid the monsoon since this state receives heavy rainfall and may result in loss of road connectivity leaving tourists stranded. The heavy rainfall and high humidity also prevent any outdoor activity."
   },
   "Jharkhand":{
      "value":"It is ideal to visit Jharkhand between October to March as the climatic conditions are most suited for sightseeing during these months. One can pack light to Jharkhand as the weather is pleasant even during winters."
   },
   "West Bengal":{
      "value":"West Bengal is best visited between October and March which is winter season in the state. Summers are scorching, and it is best to avoid any trip during this time. Between October and March, the weather is cold and pleasant, and one can enjoy a good time at the beaches as well as the hill stations. Most attractions in the state are open to the tourists only during these months, and one can get to see the brilliant monuments, heritage buildings and architectural marvels that the state houses."
   },
   "Chhattisgarh":{
      "value":"Chattisgarh has a moderate climate through most of the year and the best time to visit depends on the type of activities. Despite the high temperatures, summer is the best time for wildlife and nature tourism. The national parks and wildlife sanctuaries receive the most number of visitors during this time because of the high chance of spotting animals. However, for touring cities and the mountainous areas, winter is more suitable. The cooler climate makes sightseeing more comfortable. Mountains, waterfalls and rivers are at their best and greenest during the winter, making these natural beauties a sight to behold"
   },
   "Odisha":{
      "value":"October to March (Winter) is the best time to visit Odisha. During these months the sky remains clear, making it ideal for sightseeing and outdoor activities. The famous Konark Dance festival takes place in February, making it all the more exciting to visit the state. The state enjoys a tropical monsoon climate throughout the year because of its proximity to the sea; hence, there are incessant rains during the Monsoon season from July to September. Summers from April to June are quite hot with occasional rainfalls making it quite uncomfortable for sightseeing. Hence it's advised to plan your trip accordingly."
   },
   "Maharashtra":{
      "value":"There is no particular best time to explore the state since the eevry season has its own pros and cons. However, winters are most suitable since the weather remains calm and pleasant. Summers are too scorching but are perfect to visit hilly regions. In monsoons also, heavy downpours are observed but, rains add to the beauty of mountainous areas."
   },
   "Telangana":{
      "value":"Telangana is mostly warm through the year except for a couple of months in winters. Most tourists visit Telangana during October to March as the mercury is slightly low during this time and the pleasant weather makes for an excellent opportunity to explore the city of Nizams."
   },
   "Andhra Pradesh":{
      "value":"Best time to visit Andhra Pradesh is during the winter season, i.e. between November and February when the weather is pleasant and comfortable for the tourists to visit all the tourist attractions. Andhra Pradesh is least recommended during summer as the temperature can hit a maximum of 45°C, making it an incredibly inconvenient option to travel to the state. Heavy rainfall and high humidity levels are experienced during the monsoons which may not be what most tourists are looking for."
   },
   "Karnataka":{
      "value":"October to April is the best time to visit Karnataka. Winters are the best time to go on a wildlife safari or attend the grand Mysore Dussera. Owing to its proximity to the western coast, Karnataka is quite humid during Summers from April to June. While coastal regions are hotter, hill stations are mild and colder. Infact the best time to visit Karnataka depends on the time of the year and the destination you're travelling to. Some regions receive heavy rainfall during the monsoon season from July to September but if you want to go trekking in places like Antargange, or see the beautiful Jog Falls there's never a better time than Monsoons."
   },
   "Tamil Nadu":{
      "value":"The best time to visit Tamil Nadu is during the winter season, i.e. from November to February when the temperature is relatively low, and pleasant to explore the attractions in the state. Monsoons bring torrential downpour which makes it an inappropriate time to travel through Tamil Nadu. Summer, however, is perfect for exploring the hills stations. Tourists can pick the region they wish to see according to the season because offseason visits could be extremely inconvenient for some."
   },
   "Kerala":{
      "value":"September to February is the best time to visit Kerala when it is relatively cooler. While summers (March to May) make the state too hot for comfort and the monsoons (June - August) can receiver downpour that can heavier than imagined and is not entirely advisable to all tourists. But for some, it can be a beautiful amalgamation of festivals, scenic views and the much talked about Ayurvedic treatments."
   },
   "Goa":{
      "value":"The best time to visit Goa is between November to February when the weather is perfect, not very cold, not very hot. It's also a good time as almost all the beach shacks are open during these months. Water sports, like banana boat ride, jet ski, parasailing, etc. are also open to tourists during these months on most of the popular beaches. If you like to party, this is the time to go to Goa. Goa is considered to be one of the best places in India to enjoy Christmas and New Year season as the entire Goa is full of festivity"
   },
   "New Delhi":{
      "value":"While October to March is the best time to visit Delhi in terms of relatively cool weather, some weeks in late November to January should be avoided because of heavy smog cover. February and March have great weather and relatively clean air to travel outside. The summer months (April to July) are scorching hot in Delhi as the temperature might rise to 45 degree Celsius. Temperatures fall a little during the monsoon season (August to September) and certain days can be good for roaming around."
   },
   "Chandigarh":{
      "value":"The comparatively new city of Chandigarh, in the state of Punjab, is a perfect blend of old and new. Since Chandigarh is situated at the foothills of the Shivalik Hills, the best time to visit Chandigarh is between August and November, when the Fall is in its prime, and the weather is neither too hot nor too cold. There is an overall pleasant weather that is apt for travelling. However, the weather conditions change drastically here, thanks to the proximity of the city to the Himalayas."
   },
   "Daman and Diu":{
      "value":"The best time to visit Daman is between October - April when the ambience is heavenly and the climate pleasant. Since Daman is situated near the Arabian Sea, it experiences a tropical climate with mild winters and deary summers. Although Monsoon is a good option, the heavy rainfall in this region might make the trip a little bit inconvenient."
   },
   "Dadra and Nagar Haveli":{
      "value":"A trip to Dadra and Nagar Haveli can be planned during the winter season between November and February when the place enjoys a pleasant climate. Also, tourists can even consider visiting the tourism destination during the summer season between April and June as the summer temperature is not very high due to its proximity to the sea. The nights in Dadra and Nagar Haveli is cool and pleasant making it perfect to unwind"
   },
   "Pondicherry":{
      "value":"Pondicherry is best visited during the months of October to March as the temperature usually ranges between 15 - 30 degree celcius. Over the years, Pondicherry has truly been the gem of South India and an ideal vacation spot. Summers (April-June) are quite hot and the temperature touches 40 degree Celsius occasionally. Monsoons (July-September) is also a good time to visit Pondicherry despite the rainfalls. However, the best time to visit Pondicherry varies from person to person as the place transforms itself every season and celebrates a range of festivals which interest a lot of tourists."
   },
   "Andaman and Nicobar Islands":{
      "value":"The best time to visit Andaman & Nicobar Islands is between October and May as the weather stays bright and quite pleasant. Monsoons (July to September) are not always recommended as the waves could be unpredictable and specific regions also receive heavy downpours."
   },
   "Lakshadweep":{
      "value":"September to February are the best months to visit Lakshadweep Islands as the climatic conditions remain pleasant (between 20-30-degree Celcius). March to May are also good months but the weather will be hotter by 2-3-degree Celcius. The monsoon months of June to August experience high temperatures and heavy rainfall followed by high humidity, hence a lot of activities are shut down."
   },
   "Leh Ladakh":{
      "value":"The best time to visit Ladakh is in Summer (April - June) when the climate here is pleasant, with the snow from winter all thawed. During the rest of the year, Manali-Leh highway is not functional and the only operational way is the Srinagar-Leh highway which also gets affected by occasional landslides. The Frozen River Trek, one of the most famous treks here is carried out in the months of December and January along the river Zanskar. The only way to reach for Frozen River Trek is by flying to Leh."
   }
}
