{
    "countries":
    {
    "USA":
    "Tourist Visa validity could be upto Ten years.Short term visas (less than 10 years duration) are only granted to applicants of Indian origin who:a-Have already applied for PIO / OCI and are awaiting process completion.b-Applicants applying for Emergency visas.c-For Minors (5 years only).d-Any other category which the Consulate decides as per Government of India Regulations.",
"UK":"You only need to submit two documents while applying for an Indian E-Tourist visa-1 A scanned copy of the first and last page of your passport (PDF format).2 Passport size photograph with white background in JPEG format.3 VALIDITY-People traveling to India on a tourist or e-Business Visa can stay for up to one year with 1 year with multiple entries.4 Continuous stays cannot last for more than 180 days.",
"Canada":"People traveling to India on a tourist or e-Business Visa can stay for up to one year with 1 year with multiple entries.Continuous stays cannot last for more than 180 days.Canadians need more than just a passport to be granted entry into India. A travel visa must be obtained prior to your arrival, accompanied by a passport that's valid for a further 180 days",
"Russia":"Russian citizens need to provide two documents while applying for visa,1 A scanned copy of the first and last page of your passport (PDF format).2 Passport size photograph with white background in JPEG format.It is advisable to keep details of your parents, spouse’s, work-related information and the port of entry handy as you may need these to complete the application",
"South Africa":"Supporting Documents for Your Indian Visa Application.A recent photograph conforming to the Indian Visa Online guideline – photo must show full face, front view, eyes open and without spectacles. The background should be plain light coloured or white background .A scanned copy of your passport’s information page. Your passport must be valid for six months beyond your stay in India.VALIDITY-The e-visa is valid for 60 days from the date of arrival in India.",
"Japan":"The following documents and items will be necessary when applying for an Indian eVisa from Japan:A digital photo of the traveler.A valid passport.A passport scan of the information page.Personal questions that have been answered by the traveler.Valid online payment with a credit or debit card.VALIDITY-60 DAYS",
"China":"iVisa will do most of the work for you, but you need to provide them a few things to have your request processed. Below you will find a list of everything you need to provide: Valid passport – most Chinese can obtain passport without difficulty, and if you already have one, make sure that it is not expired. Digital photo of yourself – ensure that the photo is recent. You should not make face gestures in it, and the background should be white. Just scan it and be ready to upload it. A passport scan of the information page.Payment mode – iVisa accepts multiple methods of payment. You can use a credit or a debit card, and if you have an account on Paypal, you can use that too.Business card copy and invitation letter – this requirement applies to people who want to go to India on business and apply for an India business evisa. Letter from the hospital in India – this is valid for people who apply for a medical visa.VALIDITY OF VISA- Tourist e-Visa 30 days: they are valid for 30 days after issued and is a Double Entry.Tourist e-Visa 1 year: it's validation is for 1 year after issued and it's a Multiple Entry. But never exceeding per stay 90 days Total.Tourist e-Visa 5 years: it's valid 5 years after issued. It's a Multiple Entry and cannot never exceeding per stay 90 days Total."
,
"Brazil":"iVisa may do all the heavy lifting for Brazilian citizens, but you still need to come up with a few things to help them get started. It is nothing out of the ordinary, and you may already have what you need. Here is a list of what you must provide: Applicant Photo Passport Personal Details Scan Last Page of Passport (if applicable) Visa is valid for 90 days",
"Australia":"As part of the Indian visa requirements for Australia citizens, certain documents are required by the Indian embassy along with your eVisa application. The complete package will include the following:An online application. The application form needs to be filled out and requires the following details:Personal, educational, and professional information.Where you plan on visiting while in India, where you will land and depart from. Countries you have visited in the past 10 years. A passport sized photo. The provisions for the photos are: The face should be completely visible, and the photo should be focused.The head must be centered.The background must be white.A colored, scanned copy of the biographical page of your passport.The documents are uploaded and submitted online with the eVisa application.Australian passport holders must obtain an India eVisa at least four days before visiting India. VALIDITY-The Indian government grants an Indian tourist visa for Australians that lasts up to 90 continuous days",
"Indonesia":"no visa required",
"Bhutan":"no visa required",
"Maldives":"no visa required",
"Mauritius":"no visa required",
"Nepal":"no visa required",
"Seychelles":"no visa required",
"Fiji":"no visa required"
    }
}